openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5_rtc.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32x3x5_rtc.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2026/03/01
* Description        : This file contains all the functions prototypes for the RTC  
*                      firmware library.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32X3x5_RTC_H
#define __CH32X3x5_RTC_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "ch32x3x5.h"

/* RTC_output_source_to_output_on_the_Tamper_pin */
#define RTCOutputSource_None          ((uint32_t)0x0000)
#define RTCOutputSource_CalibClock    ((uint32_t)0x0100)
#define RTCOutputSource_Alarm         ((uint32_t)0x0200)
#define RTCOutputSource_Second        ((uint32_t)0x0600)

/* RTC_interrupts_define */
#define RTC_IT_OW            ((uint16_t)0x0004)  /* Overflow interrupt */
#define RTC_IT_ALR           ((uint16_t)0x0002)  /* Alarm interrupt */
#define RTC_IT_SEC           ((uint16_t)0x0001)  /* Second interrupt */

/* RTC_interrupts_flags */
#define RTC_FLAG_RTOFF       ((uint16_t)0x0020)  /* RTC Operation OFF flag */
#define RTC_FLAG_RSF         ((uint16_t)0x0008)  /* Registers Synchronized flag */
#define RTC_FLAG_OW          ((uint16_t)0x0004)  /* Overflow flag */
#define RTC_FLAG_ALR         ((uint16_t)0x0002)  /* Alarm flag */
#define RTC_FLAG_SEC         ((uint16_t)0x0001)  /* Second flag */

/* RTC_clock_source */
#define RTC_RTCCLKSource_LSI             ((uint32_t)0x00000000)
#define RTC_RTCCLKSource_HSE_Div512      ((uint32_t)0x00000080)
	 

void RTC_ITConfig(uint16_t RTC_IT, FunctionalState NewState);
void RTC_EnterConfigMode(void);
void RTC_ExitConfigMode(void);
uint32_t  RTC_GetCounter(void);
void RTC_SetCounter(uint32_t CounterValue);
void RTC_SetPrescaler(uint32_t PrescalerValue);
void RTC_SetAlarm(uint32_t AlarmValue);
uint32_t  RTC_GetDivider(void);
void RTC_WaitForLastTask(void);
void RTC_WaitForSynchro(void);
FlagStatus RTC_GetFlagStatus(uint16_t RTC_FLAG);
void RTC_ClearFlag(uint16_t RTC_FLAG);
ITStatus RTC_GetITStatus(uint16_t RTC_IT);
void RTC_ClearITPendingBit(uint16_t RTC_IT);
void RTC_SetRTCCalibrationValue(uint8_t CalibrationValue);
void RTC_OutputConfig(uint32_t RTCOutputSource);
void RTC_RTCCLKConfig(uint32_t RCC_RTCCLKSource);
void RTC_RTCCLKCmd(FunctionalState NewState);

#ifdef __cplusplus
}
#endif

#endif 

